---
kind: property
id: P:Autodesk.Revit.DB.Options.IncludeNonVisibleObjects
source: html/0d277b80-d5e5-1151-d413-b0899da0976f.htm
---
# Autodesk.Revit.DB.Options.IncludeNonVisibleObjects Property

Whether to extract element geometry objects not set as Visible. The default is false.

## Syntax (C#)
```csharp
public bool IncludeNonVisibleObjects { get; set; }
```